---
kind: property
id: P:Autodesk.Revit.DB.ViewSchedule.Definition
zh: 明细表
source: html/fe88f8dc-4926-4ff4-4490-7aee58d5a3f4.htm
---
# Autodesk.Revit.DB.ViewSchedule.Definition Property

**中文**: 明细表

The primary ScheduleDefinition.

## Syntax (C#)
```csharp
public ScheduleDefinition Definition { get; }
```